export const footer = {
  aboutPlatform: 'Про платформу',
  termsOfUse: 'Правила використання',
  contacts: 'Контакти',
  shortPolicy1:
    'Використання матеріалів можливе за умови дотримання Правил платформи «Доказові». Статті, блоги та переклади',
  shortPolicy2:
    'порталу мають просвітницький характер і не можуть замінити або скасувати консультацій із лікарем (-кою). Ресурс',
  shortPolicy3: 'призначено для користувачів від 18 років і старших.',
  allRightsReserved: 'Всі права захищені',
};
