const def1 = `Доказові — платформа з перевіреною і надійною інформацією про
COVID - 19, вакцинацію та інші важливі теми, пов’язані з медициною.На
платформі публікуються авторські матеріали лікарів та експертів,
  інформація від ЮНІСЕФ, а також переклади міжнародних матеріалів та
науково - популярних статей.Автори платформи Доказові — це люди, які
постійно навчаються, використовують дані з наукових джерел і
належать до авторитетних медичних спільнот.Вони постійно підвищують
рівень знань, щоб ефективно лікувати, розповідати і пояснювати.
  Принципи, за якими працює платформа Доказові: доказова медицина: на
порталі оприлюднюються матеріали, які відповідають принципу
доказової медицини відбір інформації експертами: всю інформацію для
порталу відбирають, готують і верифікують авторитетні й надійні
лікарі, експерти, фактчекери міжнародні рекомендації: відомості,
  подані на порталі, відповідають рекомендаціям ВООЗ, Центрів контролю
за захворюваннями США і сайту системи охорони здоров’я
Великобританії інформація, якою варто дилітись: закликаємо
поширювати інформацію, оприлюднену на платформі, а також
використовувати її з освітніми цілями(докладніше — у Правилах
            користування) Матеріали сайту будуть корисними сімейним лікарям та
медикам вузьких спеціальностей, науковцям, які працюють з темами
COVID - 19 і вакцинації, журналістам, які пишуть про них, батькам та
всім, хто хоче знати більше на теми, про які пише платформа
Доказові.Платформу розробили та запустили у 2021 році Дитячий фонд
ООН(ЮНІСЕФ) в Україні та SoftServe за підтримки Агентства США з
міжнародного розвитку(USAID).{ ' ' }
            Доказові — платформа з перевіреною і надійною інформацією про
            COVID-19, вакцинацію та інші важливі теми, пов’язані з медициною. На
            платформі публікуються авторські матеріали лікарів та експертів,
            інформація від ЮНІСЕФ, а також переклади міжнародних матеріалів та
            науково-популярних статей. Автори платформи Доказові — це люди, які
            постійно навчаються, використовують дані з наукових джерел і
            належать до авторитетних медичних спільнот. Вони постійно підвищують
            рівень знань, щоб ефективно лікувати, розповідати і пояснювати.
            Принципи, за якими працює платформа Доказові: доказова медицина: на
            порталі оприлюднюються матеріали, які відповідають принципу
            доказової медицини відбір інформації експертами: всю інформацію для
            порталу відбирають, готують і верифікують авторитетні й надійні
            лікарі, експерти, фактчекери міжнародні рекомендації: відомості,
            подані на порталі, відповідають рекомендаціям ВООЗ, Центрів контролю
            за захворюваннями США і сайту системи охорони здоров’я
            Великобританії інформація, якою варто дилітись: закликаємо
            поширювати інформацію, оприлюднену на платформі, а також
            використовувати її з освітніми цілями (докладніше — у Правилах
            користування) Матеріали сайту будуть корисними сімейним лікарям та
            медикам вузьких спеціальностей, науковцям, які працюють з темами
            COVID-19 і вакцинації, журналістам, які пишуть про них, батькам та
            всім, хто хоче знати більше на теми, про які пише платформа
            Доказові. Платформу розробили та запустили у 2021 році Дитячий фонд
            ООН (ЮНІСЕФ) в Україні та SoftServe за підтримки Агентства США з
            міжнародного розвитку (USAID).{' '}
       
            Доказові — платформа з перевіреною і надійною інформацією про
            COVID-19, вакцинацію та інші важливі теми, пов’язані з медициною. На
            платформі публікуються авторські матеріали лікарів та експертів,
            інформація від ЮНІСЕФ, а також переклади міжнародних матеріалів та
            науково-популярних статей. Автори платформи Доказові — це люди, які
            постійно навчаються, використовують дані з наукових джерел і
            належать до авторитетних медичних спільнот. Вони постійно підвищують
            рівень знань, щоб ефективно лікувати, розповідати і пояснювати.
            Принципи, за якими працює платформа Доказові: доказова медицина: на
            порталі оприлюднюються матеріали, які відповідають принципу
            доказової медицини відбір інформації експертами: всю інформацію для
            порталу відбирають, готують і верифікують авторитетні й надійні
            лікарі, експерти, фактчекери міжнародні рекомендації: відомості,
            подані на порталі, відповідають рекомендаціям ВООЗ, Центрів контролю
            за захворюваннями США і сайту системи охорони здоров’я
            Великобританії інформація, якою варто дилітись: закликаємо
            поширювати інформацію, оприлюднену на платформі, а також
            використовувати її з освітніми цілями (докладніше — у Правилах
            користування) Матеріали сайту будуть корисними сімейним лікарям та
            медикам вузьких спеціальностей, науковцям, які працюють з темами
            COVID-19 і вакцинації, журналістам, які пишуть про них, батькам та
            всім, хто хоче знати більше на теми, про які пише платформа
            Доказові. Платформу розробили та запустили у 2021 році Дитячий фонд
            ООН (ЮНІСЕФ) в Україні та SoftServe за підтримки Агентства США з
            міжнародного розвитку (USAID).{' '}";`;

const def2 = `"Платформа Доказові заохочує використовувати, публікувати і
            розповсюджувати оприлюднені на ній матеріали. Водночас використання
            матеріалів можливе за умов, викладених у цих правилах. Матеріали,
            оприлюднені на платформі Доказові, створені для цієї платформи, якщо
            в самій публікації не вказано інше джерело (наприклад, що це допис
            експерта у соцмережах або відео організації). Матеріали платформи
            дозволено використовувати: в інших медіа –лише за умови посилання на
            платформу Доказові: для діджитал-медіа – гіперпосилання на
            dokazovi.info не нижче першого абзацу для телебачення і радіо –
            згадка в синхроні сюжету/передачі для особистих цілей: ви можете
            завантажити або скопіювати вміст сайту, інші компоненти та елементи,
            що відображаються на сайті для освітнього процесу: як джерела для
            матеріалів занять, завдання тощо Під час використання матеріалів у
            будь-якому випадку не можна змінювати текст і візуальні матеріали,
            щоб запобігти тому, що сенс матеріалів може бути розтлумачено
            невірно, виділено з контексту або викривлено. В будь-якому випадку
            під час використання матеріалів необхідно завжди вказувати його
            автора/авторів. Використовувати матеріали платформи з метою
            отримання комерційної вигоди заборонено. Переклади матеріалів видань
            ____, ____, _____ здійснено на умовах ексклюзивної угоди між ЮНІСЕФ
            в Україні та цими виданнями. УМОВИ ПЕРЕДРУКУ ЦИХ МАТЕРІАЛІВ.Тут ще
            буде доповнення по тексту, поки за оцінками – до 1000 символів
         
            Платформа Доказові заохочує використовувати, публікувати і
            розповсюджувати оприлюднені на ній матеріали. Водночас використання
            матеріалів можливе за умов, викладених у цих правилах. Матеріали,
            оприлюднені на платформі Доказові, створені для цієї платформи, якщо
            в самій публікації не вказано інше джерело (наприклад, що це допис
            експерта у соцмережах або відео організації). Матеріали платформи
            дозволено використовувати: в інших медіа –лише за умови посилання на
            платформу Доказові: для діджитал-медіа – гіперпосилання на
            dokazovi.info не нижче першого абзацу для телебачення і радіо –
            згадка в синхроні сюжету/передачі для особистих цілей: ви можете
            завантажити або скопіювати вміст сайту, інші компоненти та елементи,
            що відображаються на сайті для освітнього процесу: як джерела для
            матеріалів занять, завдання тощо Під час використання матеріалів у
            будь-якому випадку не можна змінювати текст і візуальні матеріали,
            щоб запобігти тому, що сенс матеріалів може бути розтлумачено
            невірно, виділено з контексту або викривлено. В будь-якому випадку
            під час використання матеріалів необхідно завжди вказувати його
            автора/авторів. Використовувати матеріали платформи з метою
            отримання комерційної вигоди заборонено. Переклади матеріалів видань
            ____, ____, _____ здійснено на умовах ексклюзивної угоди між ЮНІСЕФ
            в Україні та цими виданнями. УМОВИ ПЕРЕДРУКУ ЦИХ МАТЕРІАЛІВ.Тут ще
            буде доповнення по тексту, поки за оцінками – до 1000 символів
        
            Платформа Доказові заохочує використовувати, публікувати і
            розповсюджувати оприлюднені на ній матеріали. Водночас використання
            матеріалів можливе за умов, викладених у цих правилах. Матеріали,
            оприлюднені на платформі Доказові, створені для цієї платформи, якщо
            в самій публікації не вказано інше джерело (наприклад, що це допис
            експерта у соцмережах або відео організації). Матеріали платформи
            дозволено використовувати: в інших медіа –лише за умови посилання на
            платформу Доказові: для діджитал-медіа – гіперпосилання на
            dokazovi.info не нижче першого абзацу для телебачення і радіо –
            згадка в синхроні сюжету/передачі для особистих цілей: ви можете
            завантажити або скопіювати вміст сайту, інші компоненти та елементи,
            що відображаються на сайті для освітнього процесу: як джерела для
            матеріалів занять, завдання тощо Під час використання матеріалів у
            будь-якому випадку не можна змінювати текст і візуальні матеріали,
            щоб запобігти тому, що сенс матеріалів може бути розтлумачено
            невірно, виділено з контексту або викривлено. В будь-якому випадку
            під час використання матеріалів необхідно завжди вказувати його
            автора/авторів. Використовувати матеріали платформи з метою
            отримання комерційної вигоди заборонено. Переклади матеріалів видань
            ____, ____, _____ здійснено на умовах ексклюзивної угоди між ЮНІСЕФ
            в Україні та цими виданнями. УМОВИ ПЕРЕДРУКУ ЦИХ МАТЕРІАЛІВ.Тут ще
            буде доповнення по тексту, поки за оцінками – до 1000 символів"`;

const def3 = `
            Хочете стати автором платформи? Бажаєте співпрацювати? Маєте
            запитання? Пишіть нам на contact@dokazovi.info
          
            Хочете стати автором платформи? Бажаєте співпрацювати? Маєте
            запитання? Пишіть нам на contact@dokazovi.info
          очете стати автором платформи? Бажаєте співпрацювати? Маєте
            запитання? Пишіть нам на contact@dokazovi.info
         очете стати автором платформи? Бажаєте співпрацювати? Маєте
            запитання? Пишіть нам на contact@dokazovi.info
          <`;

const getDefContent = (id: number): string => {
  switch (id) {
    case 1:
      return def1;
    case 2:
      return def2;
    default:
      return def3;
  }
};

export default getDefContent;
